In [1]:
import pandas as pd

In [2]:
# read a dataset of movie reviewers (modifying the def param val.s for read_table)
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header = None, names=user_cols, index_col = 'user_id')

In [3]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [4]:
users.zip_code.duplicated()
# ^ if True is returned, then it says that there's been an occurence of the value previously

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

In [5]:
users.zip_code.duplicated().sum() 
# ^ there're this many duplicate data

148

In [6]:
users.duplicated()
# returns True, if an entire row has come before

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [7]:
users.duplicated().sum()

7

In [9]:
users.loc[users.duplicated(keep='first'), :]
# ^ giving the # of rows that were identified duplicated
# keep:
#   'first' -- is a def, keep the 1st occurence and 
#              all others in a dframe get identified as duplicates
#   'last'  -- keep the last occurence and all before are duplicates
#    False  -- do not keep any, give all of the duplicates and make them True

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

# Dropping

In [11]:
users.drop_duplicates(keep=False).shape

(929, 4)

In [15]:
users.duplicated(subset=['age', 'zip_code'])
# only consider the age and zip_code as the relevant columns
# drop_duplicates() can be used with this data with these above params

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool